Tekla Open API Reference for Tekla Structures 2025
BaseWeld.Standard Property
Note: This API is now obsolete.
 Gets or sets the weld detail/standard.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Property not supported anymore.")]
public string Standard { get; set; }
<ObsoleteAttribute("Property not supported anymore.")>
Public Property Standard As String
	Get
	Set
Property Value
Type: String
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace